
; ----------------------------------------------------------------------
; Деление числа на другое число 16 бит
; ----------------------------------------------------------------------
; r1:r0     делимое мяу
; r3:r2     делитель мурк
; r17:r16   остаток от деления
; r19:r18   ответ десу
; r20       затронутый
; ----------------------------------------------------------------------
div:        ldi     r16, 0
            ldi     r17, 0
            ldi     r18, 0
            ldi     r19, 0
            ldi     r20, 15
divr:       add     r0, r0          ; Сдвиг на 1 бит влево 16 битного 
            adc     r1, r1
            adc     r16, r16
            adc     r17, r17
            add     r18, r18        ; Задвинуть новый бит
            add     r19, r19
            sub     r16, r2         ; Если C=1 то это амба полная
            sbc     r17, r3
            brcc    div0
            ori     r18, 1
            add     r16, r2         ; Верни его на место (С)
            adc     r16, r3
div0:       subi    r20, 1
            brpl    divr            ; 16 итерации, r20=FF будет
            eor     r18, r20
            eor     r19, r20            
            ret
