#include <avrio.h>
#include <qb.cc>

ISR(INT0_vect) {
    prn(inp(0));
}

int main() {

    cls(0x07);

    attr(0x30);
    print("CATLICENSE.TXT :: NotePad :: Author Лисяко                                 EDIT ");

    attr(0x07);
    print("Декларе ундертале\nЛИЦЕНЗИЯ NO WARRANTY ИСПОЛЬЗОВАНИЕ\nСтив крутится вокруг своей оси, почитывая Котячью Свободную Лицензию.\n\n");
    print("Основные положения КОТЯЧЬЕЙ ЛИЦЕНЗИИ:\n\n");
    print("\xF9 Все есть кот, даже Вселенная, даже Олах\n");
    print("\xF9 Тапки будут обоссаны\n");
    print("\xF9 Лоток не будет обосран\n");
    print("\xF9 Елка на Новый Год тоже хочет спать\n");
    print("\xF9 Кровать предназначена для того, чтобы там лежал КОТ\n");
    print("\xF9 Тыгыдык-тыгыдык\n");
    print("\xF9 Если сегодня тарелка пустая, то рабов ждет наказание завтра\n");
    print("\nДанные условия лицензии распространяются только на котов и на их производных, а\n");
    print("именно: пум, тигров, багир и так далее, и тому подобные. Нарушение условий\n");
    print("использования карается когтями правосудия. Кошкодевочки приветствуются, но не\n");
    print("одобряются, если оные не докладывают нужное количество мяса в миску.\n\n");
    print("ABSOLUTELY NO WARRANTY, NO TRADEMARK, USE COPYLEFT AND DISTRIBUTE FREE LICENSE.\n");
    print("Коты всегда правы, даже если кажется, что они неправы. Если это не так, проверь\n");
    print("правую сторону, чтобы в этом убедиться.\n\n");
    print("To be continued...");

    sei();
    for(;;);
}
